

__all__ = ['rect', 'sq', 'trian']  # передаем такую переменную
# В Python переменная __all__ - это список, который определяет, какие имена должны быть
# доступны для импорта из модуля при использовании инструкции from <module> import *.

# Когда вы используете from <module> import *, Python импортирует все имена, перечисленные
# в списке __all__ из модуля, если такой список определен. Это позволяет явно указать, какие
# имена считаются "публичными" и должны быть доступны для использования извне модуля.

# from geometry import *


